# Змінні для інструментів та прапорців
ASM = nasm
ASFLAGS = -f elf32 -g -F dwarf

# Використовуємо 'ld' для компонування програм без бібліотеки C
LD = ld 
LDFLAGS = -m elf_i386

# Знайти всі файли з розширенням.asm у поточній директорії
SOURCES = $(wildcard *.asm)
# Створити список імен виконуваних файлів, замінивши.asm на порожній рядок
EXECUTABLES = $(SOURCES:.asm=)

# Ціль за замовчуванням: зібрати всі виконувані файли
all: $(EXECUTABLES)

# Шаблонне правило: як створити виконуваний файл з.asm файлу
# $< - це ім'я першої залежності (вихідний.asm файл)
# $@ - це ім'я цілі (виконуваний файл)
%: %.asm
	$(ASM) $(ASFLAGS) -o $@.o $<
	$(LD) $(LDFLAGS) -o $@ $@.o

# Ціль для очищення: видаляє всі згенеровані файли
clean:
	rm -f *.o $(EXECUTABLES)
